**Terraform Format and Style🖌** `success`
**Terraform Initialization ⚙️** `success`
**Terraform Plan 📖** `success`
**Terraform Validation 🤖** `success`

<details><summary>Show Plan</summary>

```hcl
data.tls_certificate.github: Reading...
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[3]: Refreshing state... [id=28036167]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161958]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[1]: Refreshing state... [id=28036168]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26880820]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[0]: Refreshing state... [id=28036165]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26880825]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[2]: Refreshing state... [id=28036166]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26880824]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26880823]
data.tls_certificate.github: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_submission: Refreshing state... [id=26880815]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26880816]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26880818]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.spf: Refreshing state... [id=26880826]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26880813]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=29377249]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=29377247]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=29377250]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=29377246]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.bimi: Refreshing state... [id=32326123]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=29377237]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=29377239]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=29377238]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161936]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.spf: Refreshing state... [id=26161961]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161943]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26161967]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161934]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26161966]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.spf: Refreshing state... [id=26161968]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.bimi: Refreshing state... [id=32326124]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161947]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mail: Refreshing state... [id=29377236]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161946]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.spf: Refreshing state... [id=29377243]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161939]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.www_cname: Refreshing state... [id=28036169]
module.dnsimple_github_pages.dnsimple_zone_record.alias-record-root: Refreshing state... [id=26161929]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mail: Refreshing state... [id=26880812]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26880814]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161962]
module.dnsimple_short_io.dnsimple_zone_record.a_record_1: Refreshing state... [id=26982612]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mail: Refreshing state... [id=26161935]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.verify_cname: Refreshing state... [id=28036170]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.bimi: Refreshing state... [id=32326125]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161933]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161931]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161942]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161932]
module.dnsimple_short_io.dnsimple_zone_record.a_record_2: Refreshing state... [id=26982611]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161949]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26161960]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=29377244]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161972]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=29377245]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=29377241]
dnsimple_zone_record.files_wtmn_net_alias: Refreshing state... [id=27004600]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26161940]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161937]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161945]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=29377242]
dnsimple_zone_record.google_workspace_verification: Refreshing state... [id=37699481]
module.dnsimple_github_pages.dnsimple_zone_record.cname-record-www: Refreshing state... [id=26161971]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mail: Refreshing state... [id=26161951]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=26880822]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.bimi: Refreshing state... [id=32326126]
dnsimple_zone_record.github_redirect: Refreshing state... [id=26395267]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161944]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161955]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161953]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161954]
data.github_repository.terraform: Reading...
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26880821]
module.aws_fastmail_wtmn_net.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_georgewitteman_com.data.dns_a_record_set.mail: Reading...
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=26880817]
module.aws_fastmail_georgewitteman_me.data.dns_a_record_set.mail: Reading...
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=29377248]
module.aws_fastmail_witteman_me.data.dns_a_record_set.mail: Reading...
data.github_user.georgewitteman: Reading...
module.aws_fastmail_witteman_me.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_georgewitteman_com.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_georgewitteman_me.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_wtmn_net.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
data.github_repository.terraform: Read complete after 1s [id=terraform]
data.github_user.georgewitteman: Read complete after 1s [id=5918935]
aws_key_pair.georgewitteman: Refreshing state... [id=georgewitteman-personal]
aws_s3_bucket.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_kms_key.primary_kms_key: Refreshing state... [id=d5eef806-22ba-4f53-a96f-3d3e6e545e07]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::866631827662:oidc-provider/token.actions.githubusercontent.com]
aws_vpc.this: Refreshing state... [id=vpc-0ccbc14472128e737]
aws_s3_bucket.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_kms_key.dynamo_db_kms: Refreshing state... [id=1a1ca031-daf5-4f17-aa7d-2d2d2ca5a865]
data.aws_iam_policy_document.github_oidc: Reading...
data.aws_iam_policy_document.github_oidc: Read complete after 0s [id=1151702415]
aws_iam_role.github_oidc: Refreshing state... [id=GitHubActionsOIDC]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-locks]
aws_s3_bucket_server_side_encryption_configuration.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_acl.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs,log-delivery-write]
aws_s3_bucket_public_access_block.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_logging.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_versioning.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_server_side_encryption_configuration.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_route53_record.google_workspace_verification will be created
  + resource "aws_route53_record" "google_workspace_verification" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "google-site-verification=Dgy7CxrBlRf1Ucs5YonfE2m99jkPGh2RUl7BrV7EoD0",
        ]
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.georgewitteman_com will be created
  + resource "aws_route53_zone" "georgewitteman_com" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "georgewitteman.com"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + zone_id       = (known after apply)
    }

  # aws_route53_zone.georgewitteman_me will be created
  + resource "aws_route53_zone" "georgewitteman_me" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "georgewitteman.me"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + zone_id       = (known after apply)
    }

  # aws_route53_zone.marcywitteman_com will be created
  + resource "aws_route53_zone" "marcywitteman_com" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "marcywitteman.com"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + zone_id       = (known after apply)
    }

  # aws_route53_zone.witteman_me will be created
  + resource "aws_route53_zone" "witteman_me" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "witteman.me"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + zone_id       = (known after apply)
    }

  # aws_route53_zone.wtmn_net will be created
  + resource "aws_route53_zone" "wtmn_net" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "wtmn.net"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + zone_id       = (known after apply)
    }

  # aws_subnet.private["us-east-1a"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.16.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "private-us-east-1a"
        }
      + tags_all                                       = {
          + "Name"       = "private-us-east-1a"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                                         = "vpc-0ccbc14472128e737"
    }

  # aws_subnet.private["us-east-1b"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.17.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "private-us-east-1b"
        }
      + tags_all                                       = {
          + "Name"       = "private-us-east-1b"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                                         = "vpc-0ccbc14472128e737"
    }

  # aws_subnet.private["us-east-1c"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.18.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "private-us-east-1c"
        }
      + tags_all                                       = {
          + "Name"       = "private-us-east-1c"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                                         = "vpc-0ccbc14472128e737"
    }

  # aws_subnet.public["us-east-1a"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "public-us-east-1a"
        }
      + tags_all                                       = {
          + "Name"       = "public-us-east-1a"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                                         = "vpc-0ccbc14472128e737"
    }

  # aws_subnet.public["us-east-1b"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "public-us-east-1b"
        }
      + tags_all                                       = {
          + "Name"       = "public-us-east-1b"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                                         = "vpc-0ccbc14472128e737"
    }

  # aws_subnet.public["us-east-1c"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "public-us-east-1c"
        }
      + tags_all                                       = {
          + "Name"       = "public-us-east-1c"
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                                         = "vpc-0ccbc14472128e737"
    }

  # dnsimple_zone_record.google_workspace_verification must be replaced
-/+ resource "dnsimple_zone_record" "google_workspace_verification" {
      ~ id             = "37699481" -> (known after apply)
      ~ priority       = "0" -> (known after apply)
      ~ qualified_name = "witteman.me" -> (known after apply)
      ~ type           = "SOA" -> "TXT" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1593929404 86400 7200 604800 300" -> "google-site-verification=Dgy7CxrBlRf1Ucs5YonfE2m99jkPGh2RUl7BrV7EoD0"
      ~ zone_id        = "witteman.me" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.aws_fastmail_georgewitteman_com.data.aws_route53_zone.selected will be read during apply
  # (config refers to values not yet known)
 <= data "aws_route53_zone" "selected" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = (known after apply)
      + name_servers               = (known after apply)
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm1"] will be created
  + resource "aws_route53_record" "dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fm1._domainkey"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm2"] will be created
  + resource "aws_route53_record" "dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fm2._domainkey"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm3"] will be created
  + resource "aws_route53_record" "dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fm3._domainkey"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.dmarc[0] will be created
  + resource "aws_route53_record" "dmarc" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc"
      + records         = [
          + "v=DMARC1; p=reject; pct=100; rua=mailto:re+kwgr6yysiwt@dmarc.postmarkapp.com,mailto:dmarc_agg@vali.email;",
        ]
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.mail will be created
  + resource "aws_route53_record" "mail" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mail"
      + records         = [
          + "66.111.4.147",
          + "66.111.4.148",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.mx will be created
  + resource "aws_route53_record" "mx" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "10 in1-smtp.messagingengine.com",
          + "20 in2-smtp.messagingengine.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.spf will be created
  + resource "aws_route53_record" "spf" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "v=spf1 include:spf.messagingengine.com -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_caldav will be created
  + resource "aws_route53_record" "srv_caldav" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_caldav._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_caldavs will be created
  + resource "aws_route53_record" "srv_caldavs" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_caldavs._tcp"
      + records         = [
          + "0 1 443 caldav.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_carddav will be created
  + resource "aws_route53_record" "srv_carddav" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_carddav._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_carddavs will be created
  + resource "aws_route53_record" "srv_carddavs" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_carddavs._tcp"
      + records         = [
          + "0 1 443 carddav.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_imap will be created
  + resource "aws_route53_record" "srv_imap" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_imap._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_imaps will be created
  + resource "aws_route53_record" "srv_imaps" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_imaps._tcp"
      + records         = [
          + "0 1 993 imap.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_jmap will be created
  + resource "aws_route53_record" "srv_jmap" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_jmap._tcp"
      + records         = [
          + "0 1 443 api.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_pop3 will be created
  + resource "aws_route53_record" "srv_pop3" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_pop3._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_pop3s will be created
  + resource "aws_route53_record" "srv_pop3s" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_pop3s._tcp"
      + records         = [
          + "10 1 995 pop.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_submission will be created
  + resource "aws_route53_record" "srv_submission" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_submission._tcp"
      + records         = [
          + "0 1 587 smtp.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.data.aws_route53_zone.selected will be read during apply
  # (config refers to values not yet known)
 <= data "aws_route53_zone" "selected" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = (known after apply)
      + name_servers               = (known after apply)
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm1"] will be created
  + resource "aws_route53_record" "dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fm1._domainkey"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm2"] will be created
  + resource "aws_route53_record" "dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fm2._domainkey"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm3"] will be created
  + resource "aws_route53_record" "dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fm3._domainkey"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.dmarc[0] will be created
  + resource "aws_route53_record" "dmarc" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc"
      + records         = [
          + "v=DMARC1; p=reject; pct=100; rua=mailto:re+zcrwq1j87mr@dmarc.postmarkapp.com,mailto:dmarc_agg@vali.email;",
        ]
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.mail will be created
  + resource "aws_route53_record" "mail" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mail"
      + records         = [
          + "66.111.4.147",
          + "66.111.4.148",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.mx will be created
  + resource "aws_route53_record" "mx" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "10 in1-smtp.messagingengine.com",
          + "20 in2-smtp.messagingengine.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.spf will be created
  + resource "aws_route53_record" "spf" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "v=spf1 include:spf.messagingengine.com -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_caldav will be created
  + resource "aws_route53_record" "srv_caldav" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_caldav._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_caldavs will be created
  + resource "aws_route53_record" "srv_caldavs" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_caldavs._tcp"
      + records         = [
          + "0 1 443 caldav.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_carddav will be created
  + resource "aws_route53_record" "srv_carddav" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_carddav._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_carddavs will be created
  + resource "aws_route53_record" "srv_carddavs" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_carddavs._tcp"
      + records         = [
          + "0 1 443 carddav.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_imap will be created
  + resource "aws_route53_record" "srv_imap" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_imap._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_imaps will be created
  + resource "aws_route53_record" "srv_imaps" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_imaps._tcp"
      + records         = [
          + "0 1 993 imap.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_jmap will be created
  + resource "aws_route53_record" "srv_jmap" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_jmap._tcp"
      + records         = [
          + "0 1 443 api.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_pop3 will be created
  + resource "aws_route53_record" "srv_pop3" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_pop3._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_pop3s will be created
  + resource "aws_route53_record" "srv_pop3s" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_pop3s._tcp"
      + records         = [
          + "10 1 995 pop.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_submission will be created
  + resource "aws_route53_record" "srv_submission" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_submission._tcp"
      + records         = [
          + "0 1 587 smtp.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.data.aws_route53_zone.selected will be read during apply
  # (config refers to values not yet known)
 <= data "aws_route53_zone" "selected" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = (known after apply)
      + name_servers               = (known after apply)
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm1"] will be created
  + resource "aws_route53_record" "dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fm1._domainkey"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm2"] will be created
  + resource "aws_route53_record" "dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fm2._domainkey"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm3"] will be created
  + resource "aws_route53_record" "dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fm3._domainkey"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.dmarc[0] will be created
  + resource "aws_route53_record" "dmarc" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc"
      + records         = [
          + "v=DMARC1; p=reject; pct=100; rua=mailto:re+etpsv9gfdep@dmarc.postmarkapp.com,mailto:dmarc_agg@vali.email;",
        ]
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.mail will be created
  + resource "aws_route53_record" "mail" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mail"
      + records         = [
          + "66.111.4.147",
          + "66.111.4.148",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.mx will be created
  + resource "aws_route53_record" "mx" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "10 in1-smtp.messagingengine.com",
          + "20 in2-smtp.messagingengine.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.spf will be created
  + resource "aws_route53_record" "spf" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "v=spf1 include:spf.messagingengine.com -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.srv_caldav will be created
  + resource "aws_route53_record" "srv_caldav" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_caldav._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.srv_caldavs will be created
  + resource "aws_route53_record" "srv_caldavs" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_caldavs._tcp"
      + records         = [
          + "0 1 443 caldav.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.srv_carddav will be created
  + resource "aws_route53_record" "srv_carddav" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_carddav._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.srv_carddavs will be created
  + resource "aws_route53_record" "srv_carddavs" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_carddavs._tcp"
      + records         = [
          + "0 1 443 carddav.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.srv_imap will be created
  + resource "aws_route53_record" "srv_imap" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_imap._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.srv_imaps will be created
  + resource "aws_route53_record" "srv_imaps" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_imaps._tcp"
      + records         = [
          + "0 1 993 imap.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.srv_jmap will be created
  + resource "aws_route53_record" "srv_jmap" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_jmap._tcp"
      + records         = [
          + "0 1 443 api.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.srv_pop3 will be created
  + resource "aws_route53_record" "srv_pop3" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_pop3._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.srv_pop3s will be created
  + resource "aws_route53_record" "srv_pop3s" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_pop3s._tcp"
      + records         = [
          + "10 1 995 pop.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_witteman_me.aws_route53_record.srv_submission will be created
  + resource "aws_route53_record" "srv_submission" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_submission._tcp"
      + records         = [
          + "0 1 587 smtp.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.data.aws_route53_zone.selected will be read during apply
  # (config refers to values not yet known)
 <= data "aws_route53_zone" "selected" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = (known after apply)
      + name_servers               = (known after apply)
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm1"] will be created
  + resource "aws_route53_record" "dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fm1._domainkey"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm2"] will be created
  + resource "aws_route53_record" "dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fm2._domainkey"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm3"] will be created
  + resource "aws_route53_record" "dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "fm3._domainkey"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.dmarc[0] will be created
  + resource "aws_route53_record" "dmarc" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc"
      + records         = [
          + "v=DMARC1; p=reject; pct=100; rua=mailto:re+lcidla2subz@dmarc.postmarkapp.com,mailto:dmarc_agg@vali.email;",
        ]
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.mail will be created
  + resource "aws_route53_record" "mail" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mail"
      + records         = [
          + "66.111.4.147",
          + "66.111.4.148",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.mx will be created
  + resource "aws_route53_record" "mx" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "10 in1-smtp.messagingengine.com",
          + "20 in2-smtp.messagingengine.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.spf will be created
  + resource "aws_route53_record" "spf" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "v=spf1 include:spf.messagingengine.com -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.srv_caldav will be created
  + resource "aws_route53_record" "srv_caldav" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_caldav._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.srv_caldavs will be created
  + resource "aws_route53_record" "srv_caldavs" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_caldavs._tcp"
      + records         = [
          + "0 1 443 caldav.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.srv_carddav will be created
  + resource "aws_route53_record" "srv_carddav" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_carddav._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.srv_carddavs will be created
  + resource "aws_route53_record" "srv_carddavs" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_carddavs._tcp"
      + records         = [
          + "0 1 443 carddav.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.srv_imap will be created
  + resource "aws_route53_record" "srv_imap" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_imap._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.srv_imaps will be created
  + resource "aws_route53_record" "srv_imaps" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_imaps._tcp"
      + records         = [
          + "0 1 993 imap.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.srv_jmap will be created
  + resource "aws_route53_record" "srv_jmap" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_jmap._tcp"
      + records         = [
          + "0 1 443 api.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.srv_pop3 will be created
  + resource "aws_route53_record" "srv_pop3" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_pop3._tcp"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.srv_pop3s will be created
  + resource "aws_route53_record" "srv_pop3s" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_pop3s._tcp"
      + records         = [
          + "10 1 995 pop.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_fastmail_wtmn_net.aws_route53_record.srv_submission will be created
  + resource "aws_route53_record" "srv_submission" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_submission._tcp"
      + records         = [
          + "0 1 587 smtp.fastmail.com",
        ]
      + ttl             = 300
      + type            = "SRV"
      + zone_id         = (known after apply)
    }

  # module.aws_squarespace_marcywitteman_com.aws_route53_record.a will be created
  + resource "aws_route53_record" "a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "198.185.159.144",
          + "198.185.159.145",
          + "198.49.23.144",
          + "198.49.23.145",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.aws_squarespace_marcywitteman_com.aws_route53_record.verify_cname will be created
  + resource "aws_route53_record" "verify_cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ygcg8lysbebsftxsez6l"
      + records         = [
          + "verify.squarespace.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.aws_squarespace_marcywitteman_com.aws_route53_record.www_cname will be created
  + resource "aws_route53_record" "www_cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www"
      + records         = [
          + "ext-cust.squarespace.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_10[0] must be replaced
-/+ resource "dnsimple_zone_record" "mx_10" {
      ~ id             = "26161966" -> (known after apply)
      ~ priority       = "0" -> "10"
      ~ qualified_name = "georgewitteman.com" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "MX" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1593928250 86400 7200 604800 300" -> "in1-smtp.messagingengine.com"
      ~ zone_id        = "georgewitteman.com" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_20[0] must be replaced
-/+ resource "dnsimple_zone_record" "mx_20" {
      ~ id             = "26161960" -> (known after apply)
      ~ priority       = "0" -> "20"
      ~ qualified_name = "georgewitteman.com" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "MX" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1593928250 86400 7200 604800 300" -> "in2-smtp.messagingengine.com"
      ~ zone_id        = "georgewitteman.com" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.spf must be replaced
-/+ resource "dnsimple_zone_record" "spf" {
      ~ id             = "26161968" -> (known after apply)
      ~ priority       = "0" -> (known after apply)
      ~ qualified_name = "georgewitteman.com" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "TXT" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1593928250 86400 7200 604800 300" -> "v=spf1 include:spf.messagingengine.com -all"
      ~ zone_id        = "georgewitteman.com" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_10[0] must be replaced
-/+ resource "dnsimple_zone_record" "mx_10" {
      ~ id             = "29377248" -> (known after apply)
      ~ priority       = "0" -> "10"
      ~ qualified_name = "georgewitteman.me" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "MX" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1641483225 86400 7200 604800 300" -> "in1-smtp.messagingengine.com"
      ~ zone_id        = "georgewitteman.me" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_20[0] must be replaced
-/+ resource "dnsimple_zone_record" "mx_20" {
      ~ id             = "29377250" -> (known after apply)
      ~ priority       = "0" -> "20"
      ~ qualified_name = "georgewitteman.me" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "MX" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1641483225 86400 7200 604800 300" -> "in2-smtp.messagingengine.com"
      ~ zone_id        = "georgewitteman.me" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.spf must be replaced
-/+ resource "dnsimple_zone_record" "spf" {
      ~ id             = "29377243" -> (known after apply)
      ~ priority       = "0" -> (known after apply)
      ~ qualified_name = "georgewitteman.me" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "TXT" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1641483225 86400 7200 604800 300" -> "v=spf1 include:spf.messagingengine.com -all"
      ~ zone_id        = "georgewitteman.me" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_10[0] must be replaced
-/+ resource "dnsimple_zone_record" "mx_10" {
      ~ id             = "26161940" -> (known after apply)
      ~ priority       = "0" -> "10"
      ~ qualified_name = "witteman.me" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "MX" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1593929404 86400 7200 604800 300" -> "in1-smtp.messagingengine.com"
      ~ zone_id        = "witteman.me" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_20[0] must be replaced
-/+ resource "dnsimple_zone_record" "mx_20" {
      ~ id             = "26161967" -> (known after apply)
      ~ priority       = "0" -> "20"
      ~ qualified_name = "witteman.me" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "MX" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1593929404 86400 7200 604800 300" -> "in2-smtp.messagingengine.com"
      ~ zone_id        = "witteman.me" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.spf must be replaced
-/+ resource "dnsimple_zone_record" "spf" {
      ~ id             = "26161961" -> (known after apply)
      ~ priority       = "0" -> (known after apply)
      ~ qualified_name = "witteman.me" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "TXT" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1593929404 86400 7200 604800 300" -> "v=spf1 include:spf.messagingengine.com -all"
      ~ zone_id        = "witteman.me" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_10[0] must be replaced
-/+ resource "dnsimple_zone_record" "mx_10" {
      ~ id             = "26880822" -> (known after apply)
      ~ priority       = "0" -> "10"
      ~ qualified_name = "wtmn.net" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "MX" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1636000319 86400 7200 604800 300" -> "in1-smtp.messagingengine.com"
      ~ zone_id        = "wtmn.net" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_20[0] must be replaced
-/+ resource "dnsimple_zone_record" "mx_20" {
      ~ id             = "26880817" -> (known after apply)
      ~ priority       = "0" -> "20"
      ~ qualified_name = "wtmn.net" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "MX" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1636000319 86400 7200 604800 300" -> "in2-smtp.messagingengine.com"
      ~ zone_id        = "wtmn.net" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.spf must be replaced
-/+ resource "dnsimple_zone_record" "spf" {
      ~ id             = "26880826" -> (known after apply)
      ~ priority       = "0" -> (known after apply)
      ~ qualified_name = "wtmn.net" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "TXT" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1636000319 86400 7200 604800 300" -> "v=spf1 include:spf.messagingengine.com -all"
      ~ zone_id        = "wtmn.net" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_github_pages.dnsimple_zone_record.alias-record-root must be replaced
-/+ resource "dnsimple_zone_record" "alias-record-root" {
      ~ id             = "26161929" -> (known after apply)
      ~ priority       = "0" -> (known after apply)
      ~ qualified_name = "georgewitteman.com" -> (known after apply)
      ~ ttl            = "3600" -> "60"
      ~ type           = "SOA" -> "ALIAS" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1593928250 86400 7200 604800 300" -> "georgewitteman.github.io"
      ~ zone_id        = "georgewitteman.com" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_short_io.dnsimple_zone_record.a_record_1 must be replaced
-/+ resource "dnsimple_zone_record" "a_record_1" {
      ~ id             = "26982612" -> (known after apply)
      ~ priority       = "0" -> (known after apply)
      ~ qualified_name = "wtmn.link" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "A" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1636567496 86400 7200 604800 300" -> "52.21.33.16"
      ~ zone_id        = "wtmn.link" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_short_io.dnsimple_zone_record.a_record_2 must be replaced
-/+ resource "dnsimple_zone_record" "a_record_2" {
      ~ id             = "26982611" -> (known after apply)
      ~ priority       = "0" -> (known after apply)
      ~ qualified_name = "wtmn.link" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "A" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1636567496 86400 7200 604800 300" -> "52.2.56.64"
      ~ zone_id        = "wtmn.link" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[0] must be replaced
-/+ resource "dnsimple_zone_record" "a_records" {
      ~ id             = "28036165" -> (known after apply)
      ~ priority       = "0" -> (known after apply)
      ~ qualified_name = "marcywitteman.com" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "A" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1636115276 86400 7200 604800 300" -> "198.185.159.144"
      ~ zone_id        = "marcywitteman.com" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[1] must be replaced
-/+ resource "dnsimple_zone_record" "a_records" {
      ~ id             = "28036168" -> (known after apply)
      ~ priority       = "0" -> (known after apply)
      ~ qualified_name = "marcywitteman.com" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "A" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1636115276 86400 7200 604800 300" -> "198.185.159.145"
      ~ zone_id        = "marcywitteman.com" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[2] must be replaced
-/+ resource "dnsimple_zone_record" "a_records" {
      ~ id             = "28036166" -> (known after apply)
      ~ priority       = "0" -> (known after apply)
      ~ qualified_name = "marcywitteman.com" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "A" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1636115276 86400 7200 604800 300" -> "198.49.23.144"
      ~ zone_id        = "marcywitteman.com" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[3] must be replaced
-/+ resource "dnsimple_zone_record" "a_records" {
      ~ id             = "28036167" -> (known after apply)
      ~ priority       = "0" -> (known after apply)
      ~ qualified_name = "marcywitteman.com" -> (known after apply)
      ~ ttl            = "3600" -> "300"
      ~ type           = "SOA" -> "A" # forces replacement
      ~ value          = "ns1.dnsimple.com admin.dnsimple.com 1636115276 86400 7200 604800 300" -> "198.49.23.145"
      ~ zone_id        = "marcywitteman.com" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 103 to add, 0 to change, 20 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @georgewitteman, Action: `pull_request`*